ekobayuhit/GSCoupler_AM243x_DualCore/Core1_CouplerECAT_AM243/CouplerECAT_AM243.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALX_beta" --part "ALX" --package "ALX" --context "r5fss0-1" --product "INDUSTRIAL_COMMUNICATIONS_SDK_AM243x@2025.00.00" --product "MCU_PLUS_SDK_AM243x@11.01.00"
 * @v2CliArgs --device "AM2434" --package "FCCSP (ALX)" --context "r5fss0-1" --product "INDUSTRIAL_COMMUNICATIONS_SDK_AM243x@2025.00.00" --product "MCU_PLUS_SDK_AM243x@11.01.00"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom          = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1         = eeprom.addInstance();
const flash           = scripting.addModule("/board/flash/flash", {}, false);
const flash1          = flash.addInstance();
const led             = scripting.addModule("/board/led/led", {}, false);
const led1            = led.addInstance();
const led2            = led.addInstance();
const led3            = led.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const gpio3           = gpio.addInstance();
const gpio4           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const ipc             = scripting.addModule("/drivers/ipc/ipc");
const mcan            = scripting.addModule("/drivers/mcan/mcan", {}, false);
const mcan1           = mcan.addInstance();
const pruicss         = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1        = pruicss.addInstance();
const uart            = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1           = uart.addInstance();
const ethercat        = scripting.addModule("/industrial_comms/ethercat/ethercat", {}, false);
const ethercat1       = ethercat.addInstance();
const clock           = scripting.addModule("/kernel/dpl/clock");
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const timer           = scripting.addModule("/kernel/dpl/timer", {}, false);
const timer1          = timer.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

flash1.$name                         = "CONFIG_FLASH0";
flash1.peripheralDriver.$name        = "CONFIG_OSPI0";
flash1.peripheralDriver.inputClkFreq = 200000000;
flash1.peripheralDriver.child.$name  = "drivers_ospi_v0_ospi_v0_template0";

led1.$name = "CONFIG_LED0";
led1.name  = "TPIC2810";

led2.$name = "CONFIG_LED_STATUS";

led3.$name = "CONFIG_LED_ERROR";

led2.peripheralDriver = gpio1;
gpio1.$name           = "CONFIG_GPIO_LED_STATUS";
gpio1.pinDir          = "OUTPUT";
gpio1.GPIO_n.$assign  = "GPMC0_AD7";

led3.peripheralDriver = gpio2;
gpio2.$name           = "CONFIG_GPIO_LED_ERROR";
gpio2.pinDir          = "OUTPUT";
gpio2.GPIO_n.$assign  = "UART0_RTSn";

gpio3.$name          = "CONFIG_GPIO0_PHYRESET0";
gpio3.pinDir         = "OUTPUT";
gpio3.rx             = true;
gpio3.GPIO_n.$assign = "GPMC0_AD13";

gpio4.$name          = "CONFIG_GPIO0_PHYRESET1";
gpio4.pinDir         = "OUTPUT";
gpio4.GPIO_n.$assign = "PRG1_PRU1_GPO18";

i2c1.$name               = "CONFIG_I2C0";
led1.peripheralDriver    = i2c1;
eeprom1.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template1";

ipc.r5fss0_0 = "notify";
ipc.r5fss1_0 = "NONE";
ipc.r5fss1_1 = "NONE";
ipc.m4fss0_0 = "NONE";

mcan1.$name           = "CONFIG_MCAN0";
mcan1.MCAN.$assign    = "MCAN0";
mcan1.MCAN.RX.$assign = "MCAN0_RX";
mcan1.MCAN.TX.$assign = "MCAN0_TX";

const mcan_v0_template  = scripting.addModule("/drivers/mcan/v0/mcan_v0_template", {}, false);
const mcan_v0_template1 = mcan_v0_template.addInstance({}, false);
mcan_v0_template1.$name = "drivers_mcan_v0_mcan_v0_template0";
mcan1.child             = mcan_v0_template1;

uart1.$name = "CONFIG_UART_CONSOLE";

const uart_v0_template  = scripting.addModule("/drivers/uart/v0/uart_v0_template", {}, false);
const uart_v0_template1 = uart_v0_template.addInstance({}, false);
uart_v0_template1.$name = "drivers_uart_v0_uart_v0_template0";
uart1.child             = uart_v0_template1;

ethercat1.$name                                   = "CONFIG_ETHERCAT0";
ethercat1.PRU_ICSSG1_MII_G_RT.MII1_RXLINK.$assign = "PRG1_PRU1_GPO8";
ethercat1.ethphy[0].$name                         = "CONFIG_ETHPHY0";
ethercat1.ethphy[0].mdioPort                      = 3;
ethercat1.ethphy[1].$name                         = "CONFIG_ETHPHY1";

ethercat1.icss                           = pruicss1;
pruicss1.$name                           = "CONFIG_PRU_ICSS1";
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

debug_log.enableLogZoneInfo = true;

